Documents/ЛБ_РасходОтходовДМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЛБ_РасходОтходовДМ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЛБ_ДвижениеОтходов</xr:Item>
				<xr:Item>AccumulationRegister.ЛБ_ОтходыДМВПути</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесБезТары</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инкассатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерНакладной</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛомбардПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыОперацийОтходыДМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ЛБ_ОтделенияЛомбардов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_ОтделенияЛомбардов</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_ОтделенияЛомбардов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Центральный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЛБ_КадроваяИсторияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЛБ_КадроваяИсторияСотрудников</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛБ_ВидыКадровыхСобытий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ЛБ_ДвижениеОтходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ЛБ_ДвижениеОтходов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВесНетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ломбард</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛомбардПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Ломбарды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ЛБ_ВидыОперацийОтходыДМ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыОперацийОтходыДМ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПринятьПеремещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оприходовать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переместить</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ВидыКадровыхСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыКадровыхСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Прием</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачальныеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВосстановлениеВДолжности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеподтвержденныеДанные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеОплатыТруда</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_ВидыСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_ВидыСкладов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Залоги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Витрина</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтходыДМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Резерв</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбщийСкладЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлеймениеМаркировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Экспертиза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УщербыЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УщербыВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВитринаЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВитринаОбщая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Торги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтходыДМЦО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтходыДМОбщий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Находки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мониторинг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Реактивы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчебныйЦентр</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЛБ_РасходОтходовДМ/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем НеРедактировать Экспорт;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭтоНовыйДокумент = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Параметры.Ключ) Тогда
		Объект.Дата = ТекущаяДата();
		
		Если ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард Тогда
			Объект.Ответственный = ПараметрыСеанса.ТекущийСотрудник;
		Иначе
			Объект.Ответственный = Пользователи.ТекущийПользователь().Сотрудник;
		КонецЕсли;
		
		Если Параметры.Свойство("Ломбард") Тогда
			Объект.Ломбард = Параметры.Ломбард;
		Иначе
			Объект.Ломбард = ЛБ_УправлениеЛомбардом.ПолучитьОсновнойЛомбардПользователя();
		КонецЕсли;
		
		//+МАН 17.12.25
		ЗаполнитьСклады(Истина);
		
		Если Параметры.Свойство("Склад") Тогда
			Объект.Склад = Параметры.Склад;
		КонецЕсли;
		//-МАН
		
		Если Параметры.Свойство("Вес") Тогда
			Объект.ВесБезТары = Параметры.Вес;
		КонецЕсли;

		Объект.Организация = Константы.ЛБ_ОсновнаяОрганизация.Получить();
	КонецЕсли;
	
	ЗаполнитьПолучателей(Объект.Дата, Объект.Ломбард);
	ЗаполнитьИнкассаторов(Объект.Дата, Объект.Ломбард);
	
	//+МАН 17.12.25
	Если ЗначениеЗаполнено(Параметры.Ключ) Тогда
		ЗаполнитьСклады();
	КонецЕсли;
	
	Элементы.ВидОперации.СписокВыбора.Очистить();
	Элементы.ВидОперации.СписокВыбора.Добавить(Перечисления.ЛБ_ВидыОперацийОтходыДМ.Переместить);

	Объект.ВидОперации = Перечисления.ЛБ_ВидыОперацийОтходыДМ.Переместить;
	//-МАН
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.ВесБезТары = 0 Тогда
		Предупреждение("Не указан вес!
		|Проведение документа невозможно.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	//+МАН 17.12.25
	Если НЕ ЗначениеЗаполнено(Объект.Склад) Тогда
		Предупреждение("Не выбран склад отправитель!
		|Проведение документа невозможно.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	//-МАН
	
	Если НЕ ЗначениеЗаполнено(Объект.Получатель) Тогда
		Предупреждение("Не выбран получатель!
		|Проведение документа невозможно.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	//+МАН 17.12.25
	Если НЕ ЗначениеЗаполнено(Объект.СкладПолучатель) Тогда
		Предупреждение("Не выбран склад получатель!
		|Проведение документа невозможно.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	//-МАН
	
	Если НЕ ЗначениеЗаполнено(Объект.Инкассатор)
		И Объект.Получатель <> ПредопределенноеЗначение("Справочник.ЛБ_Ломбарды.ЦентральныйОфис") Тогда
		Предупреждение("Не выбран инкассатор!
		|Проведение документа невозможно.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ЕстьВесДляРасхода = ПроверитьДоступныйВес(Объект.Ломбард, Объект.Склад, Объект.ВесБезТары, ТекущаяДата());
	
	Если НЕ ЕстьВесДляРасхода Тогда
		Предупреждение("Недостаточно веса чтобы провести документ!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	УстановитьПользователя();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПользователя()
	Если ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард Тогда
		Объект.Ответственный = ПараметрыСеанса.ТекущийСотрудник;
	Иначе
		Объект.Ответственный = Пользователи.ТекущийПользователь().Сотрудник;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость()

	Если Объект.Проведен Тогда
		НеРедактировать = Истина;
		Элементы.ДекорацияСтатусДокумента.Заголовок = "Факт"; 
		Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноБордовый;  
		Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.ТусклоРозовый;
		ЭтотОбъект.ТолькоПросмотр = НеРедактировать;
	Иначе
		НеРедактировать = Ложь;
		Элементы.ДекорацияСтатусДокумента.Заголовок = "Проект"; 
		Элементы.ДекорацияСтатусДокумента.ЦветТекста = WebЦвета.ТемноЗеленый;
		Элементы.ДекорацияСтатусДокумента.ЦветФона = WebЦвета.СветлоЗеленый;
		ЭтотОбъект.ТолькоПросмотр = НеРедактировать;
	КонецЕсли;

	Если НЕ НеРедактировать И УправлениеДоступом.ЕстьРоль("ЛБ_СотрудникЦО") Тогда
		Элементы.ВесБезТары.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.ВесБезТары.ТолькоПросмотр = Истина;
	КонецЕсли;

	Если ЗначениеЗаполнено(Параметры.Ключ) Тогда
		ЭтаФорма.Заголовок = "Расход отходов ДМ " + Объект.НомерДокумента + " от " + Объект.Дата;
	Иначе
		ЭтаФорма.Заголовок = "Расход отходов ДМ";
	КонецЕсли;
	
	Если Объект.Ломбард = Справочники.ЛБ_Ломбарды.ЦентральныйОфис Тогда
		Элементы.Инкассатор.Видимость = Ложь;
	Иначе
		Элементы.Инкассатор.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьВидимость();
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение
		ИЛИ ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		Оповестить("ОтменаПроведения_ЛБ_РасходОтходовДМ", "ОбновитьСписок", Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПолучателей(Дата, Ломбард)
	
	Элементы.Получатель.СписокВыбора.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ломбард
		|ИЗ
		|	РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(
		|			&Дата,
		|			ВЫБОР
		|				КОГДА Отделение В
		|						(ВЫБРАТЬ
		|							ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
		|						ИЗ
		|							РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, Ломбард = &Ломбард) КАК ЛБ_ОтделенияЛомбардовСрезПоследних)
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
		|ГДЕ
		|	НЕ ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.Закрыт
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.НомерЛомбарда";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		Если Результат.Ломбард = Ломбард Тогда
			Продолжить;
		КонецЕсли;
		Элементы.Получатель.СписокВыбора.Добавить(Результат.Ломбард);
	КонецЦикла;

	Элементы.Получатель.СписокВыбора.Добавить(Справочники.ЛБ_Ломбарды.ЦентральныйОфис);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнкассаторов(Дата, Ломбард)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
		|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность КАК Должность,
		|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Подразделение КАК Подразделение
		|ИЗ
		|	РегистрСведений.ЛБ_КадроваяИсторияСотрудников.СрезПоследних(
		|			&Дата,
		|			Подразделение В
		|				(ВЫБРАТЬ
		|					ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард КАК Ломбард
		|				ИЗ
		|					РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, Отделение В
		|						(ВЫБРАТЬ
		|							ЛБ_ОтделенияЛомбардовСрезПоследних.Отделение КАК Отделение
		|						ИЗ
		|							РегистрСведений.ЛБ_ОтделенияЛомбардов.СрезПоследних(&Дата, Ломбард = &Ломбард) КАК ЛБ_ОтделенияЛомбардовСрезПоследних)) КАК ЛБ_ОтделенияЛомбардовСрезПоследних
		|				ГДЕ
		|					НЕ ЛБ_ОтделенияЛомбардовСрезПоследних.Ломбард.Закрыт)) КАК ЛБ_КадроваяИсторияСотрудниковСрезПоследних
		|ГДЕ
		|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыКадровыхСобытий.Увольнение)
		|	И (ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность.ЯвляетсяНачальникомОтделения
		|			ИЛИ ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность.ЯвляетсяЗаместителемНачальникаОтделения
		|			ИЛИ ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность.ЯвляетсяУправляющимЛомбарда)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛБ_КадроваяИсторияСотрудниковСрезПоследних.Должность.Наименование УБЫВ";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Пока Результат.Следующий() Цикл
		Элементы.Инкассатор.СписокВыбора.Добавить(Результат.Сотрудник);
	КонецЦикла;
	
	Если Элементы.Инкассатор.СписокВыбора.Количество() > 0 Тогда
		Объект.Инкассатор = Элементы.Инкассатор.СписокВыбора.Получить(0).Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВесДляРасхода(Дата, Ломбард, Склад)
	
	Запрос = Новый Запрос;
	//+МАН 17.12.25 Изменил запрос
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ЛБ_ДвижениеОтходовОстатки.ВесНеттоОстаток КАК ВесНеттоОстаток
	//	|ИЗ
	//	|	РегистрНакопления.ЛБ_ДвижениеОтходов.Остатки(&Дата, Ломбард = &Ломбард) КАК ЛБ_ДвижениеОтходовОстатки";
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ДвижениеОтходовОстатки.ВесНеттоОстаток КАК ВесНеттоОстаток
		|ИЗ
		|	РегистрНакопления.ЛБ_ДвижениеОтходов.Остатки(
		|			&Дата,
		|			Ломбард = &Ломбард
		|				И Склад = &Склад) КАК ЛБ_ДвижениеОтходовОстатки";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	//+МАН 17.12.25
	Запрос.УстановитьПараметр("Склад", Склад);
	//-МАН
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.ВесНеттоОстаток;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ВесБезТарыПриИзменении(Элемент)
	
	//+МАН 17.12.25 Изменил
	ДоступныйВес = ПолучитьВесДляРасхода(Объект.Дата, Объект.Ломбард, Объект.Склад);
	//-МАН
	
	Если Объект.ВесБезТары > ДоступныйВес Тогда
		Предупреждение("Вес превышает допустимый!");
		Объект.ВесБезТары = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	Если Объект.Проведен Тогда 
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("ИменаМакетов", "РасходнаяНакладная"); 
		ПараметрыФормы.Вставить("ИмяМенеджераПечати", "Документ.ЛБ_РасходОтходовДМ");
		
		ПараметрыПечати = Новый Структура;
		ПараметрыПечати.Вставить("ЗаголовокФормы", "Расход отходов ДМ " + Объект.НомерДокумента + " от " + Объект.Дата);		
		
		МассивОбъектов = Новый Массив;
		МассивОбъектов.Добавить(Объект.Ссылка);
		
		ПараметрыФормы.Вставить("ПараметрКоманды", МассивОбъектов);
		ПараметрыФормы.Вставить("ПараметрыПечати", ПараметрыПечати);
		
		ОткрытьФорму("ОбщаяФорма.ПечатьДокументов", ПараметрыФормы, ЭтаФорма,,,,,);   
	Иначе
		Предупреждение("Перед печатью необходимо провести документ!");
	КонецЕсли;	
КонецПроцедуры

//+МАН 17.12.25
&НаСервере
Функция ЗаполнитьСписокВыбораСкладов(Ломбард, Получатель = Ложь)

	МассивСкладов = Новый Массив;
	
	Если ЗначениеЗаполнено(Ломбард) И ТипЗнч(Ломбард) = Тип("СправочникСсылка.ЛБ_Ломбарды") Тогда
		Запрос = новый Запрос;
		
		Если Объект.Ломбард = Справочники.ЛБ_Ломбарды.ЦентральныйОфис Тогда
			Запрос.Текст = "ВЫБРАТЬ
							|	ЛБ_Склады.Ссылка КАК Ссылка
							|ИЗ
							|	Справочник.ЛБ_Склады КАК ЛБ_Склады
							|ГДЕ
							|	ЛБ_Склады.Владелец = &Владелец
							|	И (ЛБ_Склады.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыСкладов.ОтходыДМЦО)
							|			ИЛИ ЛБ_Склады.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыСкладов.ОтходыДМОбщий))
							|	И 111 = 111";
			
			Если Получатель Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "111 = 111", "НЕ ЛБ_Склады.Ссылка = &Склад");
			КонецЕсли;
		Иначе
			Запрос.Текст = "ВЫБРАТЬ
							|	ЛБ_Склады.Ссылка КАК Ссылка
							|ИЗ
							|	Справочник.ЛБ_Склады КАК ЛБ_Склады
							|ГДЕ
							|	ЛБ_Склады.Владелец = &Владелец
							|	И (ЛБ_Склады.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыСкладов.ОтходыДМ)
							|			ИЛИ 111 = 111";
			Если Получатель Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "111 = 111", "ЛБ_Склады.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыСкладов.ОтходыДМОбщий))");
			Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "111 = 111", "ЛБ_Склады.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыСкладов.ОтходыДМЦО)
				|			ИЛИ ЛБ_Склады.ВидСклада = ЗНАЧЕНИЕ(Перечисление.ЛБ_ВидыСкладов.ОтходыДМОбщий))");
			КонецЕсли;
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Владелец", Ломбард);
		Запрос.УстановитьПараметр("Склад", Объект.Склад);

		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			МассивСкладов.Добавить(Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивСкладов;
КонецФункции

&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)
	//Склады = ЗаполнитьСписокВыбораСкладов(Объект.Получатель);

	//Если Склады.Количество() > 1 Тогда
	//	Элементы.СкладПолучатель.СписокВыбора.ЗагрузитьЗначения(Склады);
	//ИначеЕсли Склады.Количество() = 1 Тогда
	//	Элементы.СкладПолучатель.СписокВыбора.Добавить(Склады[0]);
	//	Объект.СкладПолучатель = Склады[0];
	//КонецЕсли;
	ЗаполнитьСклады(Истина);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСклады(НовыйДокумент = Ложь)
	Если ЗначениеЗаполнено(Объект.Ломбард) Тогда
		Склады = ЗаполнитьСписокВыбораСкладов(Объект.Ломбард);
		
		Если Склады.Количество() > 1 Тогда
			Элементы.Склад.СписокВыбора.Очистить();
			Элементы.Склад.СписокВыбора.ЗагрузитьЗначения(Склады);
		ИначеЕсли Склады.Количество() = 1 Тогда
			Элементы.Склад.СписокВыбора.Очистить();
			Элементы.Склад.СписокВыбора.Добавить(Склады[0]);
			
			Если НовыйДокумент Тогда
				Объект.Склад = Склады[0];
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Получатель) Тогда
		Склады = ЗаполнитьСписокВыбораСкладов(Объект.Получатель, Истина);
		
		Если Склады.Количество() > 1 Тогда
			Элементы.СкладПолучатель.СписокВыбора.Очистить();
			Элементы.СкладПолучатель.СписокВыбора.ЗагрузитьЗначения(Склады);
		ИначеЕсли Склады.Количество() = 1 Тогда
			Элементы.СкладПолучатель.СписокВыбора.Очистить();
			Элементы.СкладПолучатель.СписокВыбора.Добавить(Склады[0]);

			Если НовыйДокумент Тогда
				Объект.СкладПолучатель = Склады[0];
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	ДоступныйВес = ПолучитьВесДляРасхода(Объект.Дата, Объект.Ломбард, Объект.Склад);
	Объект.ВесБезТары = ДоступныйВес;
КонецПроцедуры

&НаСервере
Функция ПроверитьДоступныйВес(Ломбард, Склад, Вес, Дата)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛБ_ДвижениеОтходовОстатки.ВесНеттоОстаток КАК ВесНеттоОстаток
		|ИЗ
		|	РегистрНакопления.ЛБ_ДвижениеОтходов.Остатки(
		|			&Дата,
		|			Ломбард = &Ломбард
		|				И Склад = &Склад) КАК ЛБ_ДвижениеОтходовОстатки";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ломбард", Ломбард);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда
		Возврат РезультатЗапроса.ВесНеттоОстаток >= Вес;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции
//-МАН
